from aiogram import types, Dispatcher
from create_bot import dp
import json, string

# !                                      ОБЩАЯ ЧАСТЬ                                                       #
# ! Пишем фильтр от мата в групе где есть наш бот
# ^ Мы здесь получаем сообщения, разбиваем его по разделителю, у нас получаеться список из слов которые были
# ^ отправлены, проходимся по нему циклом for и каждое слово обрабатываем. Тоесть приводим их к нижнему
# ^ регистру, убираем все маскирующие символы и получаем здесь множество из чистых слов всех которые были
# ^ отправлены пользователем в группу
# * Теперь. У нас есть файл json в котором перечислены все маты. Нам необходимо реализовать проверку, есть ли
# * в сообщении отправленым пользователем слова которые пречислены в json файле, тоесть маты. Тоесть, по сути,
# * нам нужно сравнить два огромных списка, поэтому мы и пользуемся множеством, потому что у него есть метод
# * пересечения множеств и работает он очень быстро и позволяет нам очень быстро сравнить есть совпадения или
# * нет. Формируем новое множество как аргумент, читая данные из нашего json файла.
# & И того, эта проверка если вдруг нет совпадений, тоесть нет мата возвращает нам в генератор пересечение
# & множеств, первого нашего из нашего сообщения и множества из нашего json файла. И если там совпадений нет,
# & тоесть нет мата, в генератор вернеться пустое множество. Поэтому и записываем != set (). Тоесть, если наше
# & множество не пустое которое сюда попало, то значит кто то написал мат и поэтому записываем
# & await message.reply('Маты запрещены') и удалим это сообщение await message.delete()
#@dp.message_handler()
async def stop_mats(message : types.Message):
    if {i.lower().translate(str.maketrans('', '', string.punctuation)) for i in message.text.split(' ')}\
        .intersection(set(json.load(open('bad_words.json')))) != set():
            await message.reply('Маты запрещены')
            await message.delete()

def register_handlers_other(dp : Dispatcher):
    dp.register_message_handler(stop_mats)
